#language: ru
  @all
  @1-50
  @ur

  Функционал: 1-50:Юр.Лицо - Загрузить прайс

    Предыстория:
      Дано пользователь открывает главную страницу
      И пользователь нажимает войти
      И пользователь вводит "test12@test.com" и "111111"

      @Correct
      Сценарий:
        Если пользователь нажимает загрузить прайс
        И пользователь нажимает ручная загрузка
        И пользователь нажимает выбрать файл "/home/artsiom/Загрузки/Telegram Desktop/pidaraisse12344321.csv"
        И пользователь выбирает магазин "Светлый"
        И пользователь выбирает первую строку "2"
        И пользователь выбирает первый разделитель
        И пользователь нажимает сохранить и отправить на обработку